```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_issue_labels.main will be destroyed
  # (because github_issue_labels.main is not in configuration)
  - resource "github_issue_labels" "main" {
      - id         = "playground.ashdavies.dev" -> null
      - repository = "playground.ashdavies.dev" -> null

      - label {
          - color       = "e99695" -> null
          - description = "Execute terraform workflow" -> null
          - name        = "Terraform" -> null
          - url         = "https://api.github.com/repos/ashdavies/playground.ashdavies.dev/labels/Terraform" -> null
        }
    }

  # onepassword_item.playground_secrets is tainted, so must be replaced
-/+ resource "onepassword_item" "playground_secrets" {
      ~ id       = "vaults/cdhtsaeb6xl7lk4nyz5qo6rmv4/items/nv6tfq4zxsubmm7f5iaia5blfu" -> (known after apply)
      + password = (sensitive value)
      ~ uuid     = "nv6tfq4zxsubmm7f5iaia5blfu" -> (known after apply)
      - vault    = "cdhtsaeb6xl7lk4nyz5qo6rmv4" -> null
        # (2 unchanged attributes hidden)

      ~ section {
          ~ id    = "2af86716-6f21-8060-7c79-38850689e576" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ field {
              ~ id    = "yoboi4fbebqw4nsperwwqyht24" -> (known after apply)
                # (3 unchanged attributes hidden)
            }
        }
      ~ section {
          ~ id    = "e42d2990-1ea0-5633-580f-4e9aeff9a37f" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ field {
              ~ id    = "4cpvsxwapakay2okkhlg64b7ie" -> (known after apply)
                # (3 unchanged attributes hidden)
            }
          ~ field {
              ~ id    = "mhr2fqqvtlp2pnds5udigl4req" -> (known after apply)
                # (3 unchanged attributes hidden)
            }
        }
    }

  # module.github-repository.github_issue_label.main["Bug"] will be created
  + resource "github_issue_label" "main" {
      + color       = "D73A4A"
      + description = "Indicates an unexpected problem or unintended behavior"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Bug"
      + repository  = "playground.ashdavies.dev"
      + url         = (known after apply)
    }

  # module.github-repository.github_issue_label.main["Enhancement"] will be created
  + resource "github_issue_label" "main" {
      + color       = "c5def5"
      + description = "Indicates new feature requests"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Enhancement"
      + repository  = "playground.ashdavies.dev"
      + url         = (known after apply)
    }

  # module.github-repository.github_repository.main will be created
  + resource "github_repository" "main" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Playground"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "playground.ashdavies.dev"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "compose-multiplatform",
          + "kotlin-multiplatform",
        ]
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->